X_WS_SOAP_Java/wsdl/wsimport/DocLiteralBare/DocLiteralBareServiceSEI.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. 
	RI's version is JAX-WS RI 2.1.6 in JDK 6. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. 
	RI's version is JAX-WS RI 2.1.6 in JDK 6. -->
<definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns:tns="http://bare.literal.doc.binding.ws.pg.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://bare.literal.doc.binding.ws.pg.com/"
	name="DocLiteralBareServiceSEI">
	<types>
		<xsd:schema>
			<xsd:import namespace="http://bare.literal.doc.binding.ws.pg.com/"
				schemaLocation="http://localhost:7733/style/docliteralbare?xsd=1"></xsd:import>
		</xsd:schema>
	</types>
	<message name="getExchangeRate">
		<part name="getExchangeRate" element="tns:getExchangeRate"></part>
	</message>
	<message name="getExchangeRateResponse">
		<part name="getExchangeRateResponse" element="tns:getExchangeRateResponse"></part>
	</message>
	<portType name="DocLiteralBareService">
		<operation name="getExchangeRate">
			<input message="tns:getExchangeRate"></input>
			<output message="tns:getExchangeRateResponse"></output>
		</operation>
	</portType>
	<binding name="DocLiteralBareServiceImplPortBinding" type="tns:DocLiteralBareService">
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http"
			style="document"></soap:binding>
		<operation name="getExchangeRate">
			<soap:operation soapAction=""></soap:operation>
			<input>
				<soap:body use="literal"></soap:body>
			</input>
			<output>
				<soap:body use="literal"></soap:body>
			</output>
		</operation>
	</binding>
	<service name="DocLiteralBareServiceSEI">
		<port name="DocLiteralBareServiceImplPort" binding="tns:DocLiteralBareServiceImplPortBinding">
			<soap:address location="http://localhost:7733/style/docliteralbare"></soap:address>
		</port>
	</service>
</definitions>