X_WS_SOAP_Java/soap/DocLiteralBare/DocLiteralBareService_Req_Res.xml

<?xml version="1.0"  standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Body>
		<ns2:getExchangeRate xmlns:ns2="http://bare.literal.doc.binding.ws.pg.com/">
			<amount>1.0</amount>
			<currency>USD</currency>
		</ns2:getExchangeRate>
	</S:Body>
</S:Envelope>


<?xml version="1.0"  standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Body>
		<ns2:getExchangeRateResponse
			xmlns:ns2="http://bare.literal.doc.binding.ws.pg.com/">
			<amount>68.0</amount>
			<currency>INR</currency>
		</ns2:getExchangeRateResponse>
	</S:Body>
</S:Envelope>

<!-- ----------------------------- WSDL -->

	<types>
		<xsd:schema>
			<xsd:import namespace="http://bare.literal.doc.binding.ws.pg.com/"
				schemaLocation="http://localhost:7733/style/docliteralbare?xsd=1"></xsd:import>
		</xsd:schema>
	</types>
	<message name="getExchangeRate">
		<part name="getExchangeRate" element="tns:getExchangeRate"></part>
	</message>
	<message name="getExchangeRateResponse">
		<part name="getExchangeRateResponse" element="tns:getExchangeRateResponse"></part>
	</message>
	<portType name="DocLiteralBareService">
		<operation name="getExchangeRate">
			<input message="tns:getExchangeRate"></input>
			<output message="tns:getExchangeRateResponse"></output>
		</operation>
	</portType>
	<binding name="DocLiteralBareServiceImplPortBinding" type="tns:DocLiteralBareService">
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http"
			style="document"></soap:binding>
		<operation name="getExchangeRate">
			<soap:operation soapAction=""></soap:operation>
			<input>
				<soap:body use="literal"></soap:body>
			</input>
			<output>
				<soap:body use="literal"></soap:body>
			</output>
		</operation>
	</binding>